# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..Name Property
MacroModule Class See Also
---
The name of the module.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace